In [13]:
import pandas as pd
import numpy as np
import seaborn as cns

In [14]:
df = pd.read_csv('supershops.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [15]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

In [10]:
df.dropna()

    Marketing Spend  Administration  Transport     Area     Profit
0         114523.61       136897.80  471784.10    Dhaka  192261.83
1         162597.70       151377.59  443898.53      Ctg  191792.06
2         153441.51       101145.55  407934.54  Rangpur  191050.39
3         144372.41       118671.85  383199.62    Dhaka  182901.99
4         142107.34        91391.77  366168.42  Rangpur  166187.94
5         131876.90        99814.71  362861.36    Dhaka  156991.12
6         134615.46       147198.87  127716.82      Ctg  156122.51
7         130298.13       145530.06  323876.68  Rangpur  155752.60
8         120542.52       148718.95  311613.29    Dhaka  152211.77
9         123334.88       108679.17  304981.62      Ctg  149759.96
10        101913.08       110594.11  229160.95  Rangpur  146121.95
11        100671.96        91790.61  249744.55      Ctg  144259.40
12         93863.75       127320.38  249839.44  Rangpur  141585.52
13         91992.39       135495.07  252664.93      Ctg  134307.35
14        119943.24       156547.42  256512.92  Rangpur  132602.65
15        165349.20       122616.84  261776.23    Dhaka  129917.04
16         78013.11       121597.55  264346.06      Ctg  126992.93
17         94657.16       145077.58  282574.31    Dhaka  125370.37
18         91749.16       114175.79  294919.57  Rangpur  124266.90
20         76253.86       113867.30  298664.47      Ctg  118474.03
21         78389.47       153773.43  299737.29    Dhaka  111313.02
22         73994.56       122782.75  303319.26  Rangpur  110352.25
23         67532.53       105751.03  304768.73  Rangpur  108733.99
24         77044.01        99281.34  140574.81    Dhaka  108552.04
25         64664.71       139553.16  137962.62      Ctg  107404.34
26         75328.87       144135.98  134050.07  Rangpur  105733.54
27         72107.60       127864.55  353183.81    Dhaka  105008.31
28         66051.52       182645.56  118148.20  Rangpur  103282.38
29         65605.48       153032.06  107138.38    Dhaka  101004.64
30         61994.48       115641.28   91131.24  Rangpur   99937.59
31         61136.38       152701.92   88218.23    Dhaka   97483.56
32         63408.86       129219.61   46085.25      Ctg   97427.84
33         55493.95       103057.49  214634.81  Rangpur   96778.92
34         46426.07       157693.92  210797.67      Ctg   96712.80
35         46014.02        85047.44  205517.64    Dhaka   96479.51
36         28663.76       127056.21  201126.82  Rangpur   90708.19
37         44069.95        51283.14  197029.42      Ctg   89949.14
38         20229.59        65947.93  185265.10    Dhaka   81229.06
39         38558.51        82982.09  174999.30      Ctg   81005.76
40         28754.33       118546.05  172795.67      Ctg   78239.91
41         27892.92        84710.77  164470.71  Rangpur   77798.83
42         23640.93        96189.63  148001.11      Ctg   71498.49
43         15505.73       127382.30   35534.17    Dhaka   69758.98
44         22177.74       154806.14   28334.72      Ctg   65200.33
45          1000.23       124153.04    1903.93    Dhaka   64926.08
46          1315.46       115816.21  297114.46  Rangpur   49490.75
47             0.00       135426.92       0.00      Ctg   42559.73
48           542.05        51743.15       0.00    Dhaka   35673.41
49             0.00       116983.80   45173.06      Ctg   14681.40

In [16]:
df.shape

(50, 5)

In [17]:
df.dropna().shape

(49, 5)

In [18]:
df.dropna(inplace = True)

In [19]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# MinMax Scaler / Normalization

In [20]:
from sklearn.preprocessing import MinMaxScaler

In [21]:
m = MinMaxScaler() #creating object for MinMax Scaler

In [22]:
ms_fit = m.fit(df[['Marketing Spend']]) #fit / train
ms_fit

MinMaxScaler()

In [23]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [24]:
df['Marketing Spend'] = m.transform(df[['Marketing Spend']]) #transform the data

In [25]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [26]:
#At a time fit & transform
df['Administration'] = m.transform(df[['Administration']])

In [27]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.827931  471784.10    Dhaka  192261.83
1         0.983359        0.915502  443898.53      Ctg  191792.06
2         0.927985        0.611709  407934.54  Rangpur  191050.39
3         0.873136        0.717704  383199.62    Dhaka  182901.99
4         0.859438        0.552720  366168.42  Rangpur  166187.94

In [28]:
df['Transport'] = m.transform(df[['Transport']])

In [29]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.827931   2.853259    Dhaka  192261.83
1         0.983359        0.915502   2.684613      Ctg  191792.06
2         0.927985        0.611709   2.467109  Rangpur  191050.39
3         0.873136        0.717704   2.317517    Dhaka  182901.99
4         0.859438        0.552720   2.214516  Rangpur  166187.94

In [30]:
df['Profit'] = m.transform(df[['Profit']])

In [32]:
df.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.692617        0.827931   2.853259    Dhaka  1.162762
1         0.983359        0.915502   2.684613      Ctg  1.159921
2         0.927985        0.611709   2.467109  Rangpur  1.155436
3         0.873136        0.717704   2.317517    Dhaka  1.106156
4         0.859438        0.552720   2.214516  Rangpur  1.005073

# Standardization

In [34]:
from sklearn.preprocessing import StandardScaler

In [35]:
s = StandardScaler() #creating object for StandardScaler

In [36]:
s_fit = s.fit(df[['Marketing Spend']]) #fit / train
s_fit

StandardScaler()

In [42]:
df.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.692617        1.383068   2.853259    Dhaka  1.162762
1         0.983359        1.698768   2.684613      Ctg  1.159921
2         0.927985        0.603569   2.467109  Rangpur  1.155436
3         0.873136        0.985691   2.317517    Dhaka  1.106156
4         0.859438        0.390909   2.214516  Rangpur  1.005073

In [43]:
df['Marketing Spend'] = s.transform(df[['Marketing Spend']]) #transform the data

In [44]:
df.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.895248        1.383068   2.853259    Dhaka  1.162762
1         1.943398        1.698768   2.684613      Ctg  1.159921
2         1.743767        0.603569   2.467109  Rangpur  1.155436
3         1.546035        0.985691   2.317517    Dhaka  1.106156
4         1.496650        0.390909   2.214516  Rangpur  1.005073

In [45]:
#At a time fit & transform
df['Administration'] = s.transform(df[['Administration']])

In [46]:
df.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.895248        3.384377   2.853259    Dhaka  1.162762
1         1.943398        4.522499   2.684613      Ctg  1.159921
2         1.743767        0.574223   2.467109  Rangpur  1.155436
3         1.546035        1.951803   2.317517    Dhaka  1.106156
4         1.496650       -0.192431   2.214516  Rangpur  1.005073

In [47]:
df['Transport'] = s.transform(df[['Transport']])
df.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.895248        3.384377   8.684527    Dhaka  1.162762
1         1.943398        4.522499   8.076544      Ctg  1.159921
2         1.743767        0.574223   7.292428  Rangpur  1.155436
3         1.546035        1.951803   6.753137    Dhaka  1.106156
4         1.496650       -0.192431   6.381810  Rangpur  1.005073

In [48]:
df['Profit'] = s.transform(df[['Profit']])

In [49]:
df.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.895248        3.384377   8.684527    Dhaka  2.590159
1         1.943398        4.522499   8.076544      Ctg  2.579916
2         1.743767        0.574223   7.292428  Rangpur  2.563746
3         1.546035        1.951803   6.753137    Dhaka  2.386088
4         1.496650       -0.192431   6.381810  Rangpur  2.021675

# Max Abs Scaler

In [50]:



from sklearn.preprocessing import MaxAbsScaler

In [51]:
mas = MaxAbsScaler()

In [52]:
mas_fit= mas.fit(df[['Marketing Spend']]) #fit / train
mas_fit

MaxAbsScaler()

In [53]:
df.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.895248        3.384377   8.684527    Dhaka  2.590159
1         1.943398        4.522499   8.076544      Ctg  2.579916
2         1.743767        0.574223   7.292428  Rangpur  2.563746
3         1.546035        1.951803   6.753137    Dhaka  2.386088
4         1.496650       -0.192431   6.381810  Rangpur  2.021675

In [54]:
df['Administration'] = mas.transform(df[['Administration']]) #transform the data

In [55]:
df.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.895248        1.689327   8.684527    Dhaka  2.590159
1         1.943398        2.257425   8.076544      Ctg  2.579916
2         1.743767        0.286626   7.292428  Rangpur  2.563746
3         1.546035        0.974251   6.753137    Dhaka  2.386088
4         1.496650       -0.096053   6.381810  Rangpur  2.021675

In [56]:
#At a time fit & transform
df['Administration'] = mas.transform(df[['Administration']])

In [57]:
df.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.895248        0.843235   8.684527    Dhaka  2.590159
1         1.943398        1.126804   8.076544      Ctg  2.579916
2         1.743767        0.143071   7.292428  Rangpur  2.563746
3         1.546035        0.486302   6.753137    Dhaka  2.386088
4         1.496650       -0.047945   6.381810  Rangpur  2.021675

In [58]:
df['Transport'] = mas.transform(df[['Transport']])

In [59]:
df.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.895248        0.843235   4.334920    Dhaka  2.590159
1         1.943398        1.126804   4.031442      Ctg  2.579916
2         1.743767        0.143071   3.640048  Rangpur  2.563746
3         1.546035        0.486302   3.370858    Dhaka  2.386088
4         1.496650       -0.047945   3.185508  Rangpur  2.021675

In [60]:
df['Profit'] = mas.transform(df[['Profit']])
df.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.895248        0.843235   4.334920    Dhaka  1.292889
1         1.943398        1.126804   4.031442      Ctg  1.287777
2         1.743767        0.143071   3.640048  Rangpur  1.279705
3         1.546035        0.486302   3.370858    Dhaka  1.191026
4         1.496650       -0.047945   3.185508  Rangpur  1.009128

# Robust Scaler

In [68]:
from sklearn.preprocessing import RobustScaler

In [69]:
rs = RobustScaler() #creating object for MinMax Scaler

In [72]:
rs_fit = rs.fit(df[['Marketing Spend']]) #fit / train
rs_fit

RobustScaler()

In [73]:
df.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.895248        0.843235   4.334920    Dhaka  1.292889
1         1.943398        1.126804   4.031442      Ctg  1.287777
2         1.743767        0.143071   3.640048  Rangpur  1.279705
3         1.546035        0.486302   3.370858    Dhaka  1.191026
4         1.496650       -0.047945   3.185508  Rangpur  1.009128

In [74]:
df['Marketing Spend'] = rs.transform(df[['Marketing Spend']]) #transform the data

In [75]:
df.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.669502        0.843235   4.334920    Dhaka  1.292889
1         1.428312        1.126804   4.031442      Ctg  1.287777
2         1.283789        0.143071   3.640048  Rangpur  1.279705
3         1.140641        0.486302   3.370858    Dhaka  1.191026
4         1.104889       -0.047945   3.185508  Rangpur  1.009128

In [76]:
#At a time fit & transform
df['Administration'] = rs.transform(df[['Administration']])

In [77]:
df.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.669502        0.631847   4.334920    Dhaka  1.292889
1         1.428312        0.837137   4.031442      Ctg  1.287777
2         1.283789        0.124962   3.640048  Rangpur  1.279705
3         1.140641        0.373445   3.370858    Dhaka  1.191026
4         1.104889       -0.013325   3.185508  Rangpur  1.009128

In [78]:
df['Transport'] = rs.transform(df[['Transport']])

In [79]:
df.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.669502        0.631847   3.159660    Dhaka  1.292889
1         1.428312        0.837137   2.939956      Ctg  1.287777
2         1.283789        0.124962   2.656605  Rangpur  1.279705
3         1.140641        0.373445   2.461725    Dhaka  1.191026
4         1.104889       -0.013325   2.327541  Rangpur  1.009128

In [80]:
df['Profit'] = rs.transform(df[['Profit']])

In [81]:
df.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.669502        0.631847   3.159660    Dhaka  0.957375
1         1.428312        0.837137   2.939956      Ctg  0.953674
2         1.283789        0.124962   2.656605  Rangpur  0.947831
3         1.140641        0.373445   2.461725    Dhaka  0.883631
4         1.104889       -0.013325   2.327541  Rangpur  0.751946

# Max

In [82]:
df = pd.read_csv('supershops.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [83]:
max_val = df['Marketing Spend'].max()

In [84]:
max_val

165349.2

In [85]:
df['Marketing Spend'] = df['Marketing Spend'] / max_val

In [86]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94